app/Controllers/admin/Aktivitas.php

SELECT *
FROM `tb_aktivitas`
---
    public function index()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }
        $aktivitas_model = new AktivitasModel();
        $all_data_aktivitas = $aktivitas_model->findAll();