app/Controllers/admin/Produk.php

    public function index()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }
        $produk_model = new ProdukModel();
        $all_data_produk = $produk_model->findAll();
---
SELECT *
FROM `tb_produk`

    public function tambah()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }
        $produk_model = new ProdukModel();
        $all_data_produk = $produk_model->findAll();
---
SELECT *
FROM `tb_produk`