app/Controllers/user/Aboutctrl.php

SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Tentang Kami'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
---
    public function index()
    {

        $meta = $this->MetaModel->where('nama_halaman', 'Tentang Kami')->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'meta' => $meta
        ];