app/Controllers/user/Aktivitasctrl.php

    public function index()
    {
        $lang = session()->get('lang') ?? 'en';

        $meta = $this->MetaModel->where('nama_halaman', 'Klien')->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'lang' => $lang,
            'meta' => $meta,
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Klien'
 LIMIT 1
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`
SELECT *
FROM `tb_profil`

    public function detail($slug_aktivitas)
    {
        // Ambil bahasa dari session, default ke 'id' jika tidak ada
        $lang = session()->get('lang') ?? 'id';

        // Cari aktivitas berdasarkan slug untuk bahasa Indonesia dan Inggris
        $aktivitas = $this->AktivitasModel->where('slug_id', $slug_aktivitas)
            ->orWhere('slug_en', $slug_aktivitas)
            ->first();
---
SELECT *
FROM `tb_aktivitas`
WHERE `slug_id` = 'indosat'
OR `slug_en` = 'indosat'
 LIMIT 1

        $nama_aktivitas = $lang === 'id' ? $aktivitas->nama_aktivitas_in : $aktivitas->nama_aktivitas_en;
        $deskripsi_aktivitas = $lang === 'id' ? strip_tags($aktivitas->deskripsi_aktivitas_in) : strip_tags($aktivitas->deskripsi_aktivitas_en);

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbaktivitas' => $aktivitas,  // Aktivitas ditemukan
            'nama_aktivitas' => $nama_aktivitas,
            'deskripsi_aktivitas' => $deskripsi_aktivitas,
            'lang' => $lang, // Kirim variabel bahasa ke view
        ];
---
SELECT *
FROM `tb_profil`