app/Controllers/user/Artikelctrl.php

SELECT *
FROM `tb_profil`
---
    public function detail($id_artikel)
    {
        $artikel = $this->ArtikelModel->getDetailArtikel($id_artikel);

        if (!$artikel) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Artikel dengan ID $id_artikel tidak ditemukan");
        }

        // Tentukan bahasa (dengan fallback jika tidak ada session)
        $language = session('lang') ?? 'in';

        // Memilih judul dan deskripsi berdasarkan session bahasa
        $judul_artikel = $language === 'in' ? $artikel->judul_artikel : $artikel->judul_artikel_en;
        $deskripsi_artikel = $language === 'in' ? $artikel->deskripsi_artikel : $artikel->deskripsi_artikel_en;

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'artikel' => $artikel,
            'artikel_lain' => $this->ArtikelModel->getArtikelLainnya($id_artikel, 4),
            'judul_artikel' => $judul_artikel,
            'deskripsi_artikel' => $deskripsi_artikel,
            'language' => $language, // Kirim variabel bahasa ke view
        ];