app/Controllers/user/Artikelctrl.php

    public function index()
    {
        // Ambil bahasa dari session, default 'en'
        $lang = session()->get('lang') ?? 'en';

        $meta = $this->MetaModel->where('nama_halaman', 'Blog')->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(),
            'lang' => $lang,
            'meta' => $meta
        ];
---
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`

    public function detail($slug_artikel)
    {
        $lang = session()->get('lang') ?? 'en';

        // Cari artikel berdasarkan slug, bukan ID
        $artikel = $this->ArtikelModel->where('slug_id', $slug_artikel)
            ->orWhere('slug_en', $slug_artikel)
            ->first();

        if (!$artikel) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Artikel dengan slug $slug_artikel tidak ditemukan");
        }

        // Tentukan bahasa (dengan fallback jika tidak ada session)
        $language = session('lang') ?? 'in';


        // Memilih judul dan deskripsi berdasarkan session bahasa
        $judul_artikel = $language === 'in' ? $artikel->judul_artikel : $artikel->judul_artikel_en;
        $deskripsi_artikel = $language === 'in' ? $artikel->deskripsi_artikel : $artikel->deskripsi_artikel_en;

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'artikel' => $artikel,
            'artikel_lain' => $this->ArtikelModel->getArtikelLainnya($artikel->id_artikel, 4),  // Gunakan ID dari artikel yang ditemukan
            'judul_artikel' => $judul_artikel,
            'deskripsi_artikel' => $deskripsi_artikel,
            'language' => $language, // Kirim variabel bahasa ke view
            'lang' => $lang,
        ];
---
SELECT *
FROM `tb_artikel`
WHERE `slug_id` = 'sertifikasi-junior-programmer-untuk-mahasiswa-magang-di-elecomp-indonesia'
OR `slug_en` = 'sertifikasi-junior-programmer-untuk-mahasiswa-magang-di-elecomp-indonesia'
 LIMIT 1
SELECT *
FROM `tb_profil`