app/Controllers/user/Homectrl.php

    public function index()
    {
        $lang = session()->get('lang') ?? 'en';

        $meta = $this->MetaModel->where('nama_halaman', 'Beranda')->first();

        $artikelTerbaru = $this->ArtikelModel->getArtikelTerbaru();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'artikel_terbaru' => $artikelTerbaru[0], // Mendapatkan artikel terbaru pertama
            'artikelterbaru' => $artikelTerbaru, // Artikel lainnya tetap ditampilkan di home
            'meta' => $meta,
            'lang' => $lang
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Beranda'
 LIMIT 1
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_profil`