app/Controllers/user/Productsctrl.php

    public function index()
    {
        $lang = session()->get('lang') ?? 'en';

        $meta = $this->MetaModel->where('nama_halaman', 'Materi Pelatihan')->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'lang' => $lang,
            'meta' => $meta
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Materi Pelatihan'
 LIMIT 1
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_profil`

    public function detail($slug_produk)
    {
        // Cari produk berdasarkan slug
        $produk = $this->ProdukModel->where('slug_id', $slug_produk)
            ->orWhere('slug_en', $slug_produk)
            ->first();

        // Jika produk tidak ditemukan, tampilkan halaman 404
        if (!$produk) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Produk dengan slug $slug_produk tidak ditemukan");
        }

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbproduk' => $produk,  // Menggunakan produk yang ditemukan berdasarkan slug
        ];
---
SELECT *
FROM `tb_produk`
WHERE `slug_id` = 'entrepreneurship-training'
OR `slug_en` = 'entrepreneurship-training'
 LIMIT 1
SELECT *
FROM `tb_profil`