app/Controllers/user/Sitemapctrl.php

    public function index()
    {
        // Inisialisasi model
        $aktivitasModel = new AktivitasModel();
        $produkModel = new ProdukModel();
        $artikelModel = new ArtikelModel();

        // Ambil data dari database
        $aktivitasData = $aktivitasModel->findAll();
        $productsData = $produkModel->findAll();
        $artikelData = $artikelModel->findAll();
---
SELECT *
FROM `tb_aktivitas`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_artikel`