app/Models/ArtikelModel.php

SELECT *
FROM `tb_artikel`
ORDER BY `id_artikel` DESC
---
    public function getArtikelTerbaru()
    {
        return $this->orderBy('id_artikel', 'desc')
            ->findAll();

SELECT *
FROM `tb_artikel`
WHERE `tb_artikel`.`id_artikel` = '15'
---
    public function getDetailArtikel($id_artikel)
    {
        $artikel = $this->find($id_artikel);

SELECT *
FROM `tb_artikel`
WHERE `id_artikel` != '15'
ORDER BY `id_artikel` ASC
---
    public function getArtikelLainnya($id_artikel, $limit = 4)
    {
        return $this->where('id_artikel !=', $id_artikel)
            ->orderBy('id_artikel', 'ASC')
            ->limit($limit)
            ->findAll();